ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_dev_cfg_regs.xml
<module id="DEV_CFG_REGS" HW_revision="" description="DEV CFG Registers">
	<register id="PARTIDL" width="32" page="1" offset="0x8" internal="0" description="Lower 32-bit of Device PART Identification Number">
		<bitfield id="QUAL" description="Qualification Status" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="PIN_COUNT" description="Device Pin Count" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="INSTASPIN" description="Instaspin feature set" begin="14" end="13" width="2" rwaccess="RW"/>
		<bitfield id="FLASH_SIZE" description="FLASH_SIZE" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="PARTIDH" width="32" page="1" offset="0xa" internal="0" description="Upper 32-bit of Device PART Identification Number">
		<bitfield id="FAMILY" description="Device family" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="PARTNO" description="Device part number" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="DEVICE_CLASS_ID" description="Device class ID" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="REVID" width="32" page="1" offset="0xc" internal="0" description="Device Revision Number">
		<bitfield id="REVID" description="Device Revision ID. This is specific to the Device" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="REVID_EXT" description="Device Revision ID Extension" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="TRIMERRSTS" width="32" page="1" offset="0x74" internal="0" description="TRIM Error Status register">
		<bitfield id="LERR" description="TRIM Load error status" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES0" width="32" page="1" offset="0x82" internal="0" description="Processing Block Software Reset register">
		<bitfield id="CPU1_CLA1" description="CPU1_CLA1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ERAD" description="ERAD Module reset bit" begin="24" end="24" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES2" width="32" page="1" offset="0x86" internal="0" description="EPWM Software Reset register">
		<bitfield id="EPWM1" description="EPWM1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="EPWM2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="EPWM3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="EPWM4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="EPWM5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="EPWM6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="EPWM7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8" description="EPWM8 software reset bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9" description="EPWM9 software reset bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10" description="EPWM10 software reset bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11" description="EPWM11 software reset bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12" description="EPWM12 software reset bit" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES3" width="32" page="1" offset="0x88" internal="0" description="ECAP Software Reset register">
		<bitfield id="ECAP1" description="ECAP1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2" description="ECAP2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES4" width="32" page="1" offset="0x8a" internal="0" description="EQEP Software Reset register">
		<bitfield id="EQEP1" description="EQEP1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EQEP2" description="EQEP2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EQEP3" description="EQEP3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES7" width="32" page="1" offset="0x90" internal="0" description="SCI Software Reset register">
		<bitfield id="SCI_A" description="SCI_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SCI_B" description="SCI_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SCI_C" description="SCI_C software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES8" width="32" page="1" offset="0x92" internal="0" description="SPI Software Reset register">
		<bitfield id="SPI_A" description="SPI_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SPI_B" description="SPI_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES9" width="32" page="1" offset="0x94" internal="0" description="I2C Software Reset register">
		<bitfield id="I2C_A" description="I2C_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="I2C_B" description="I2C_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES10" width="32" page="1" offset="0x96" internal="0" description="CAN Software Reset register">
		<bitfield id="MCAN_A" description="MCAN_A  software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B" description="MCAN_B  software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES11" width="32" page="1" offset="0x98" internal="0" description="McBSP/USB Software Reset register">
		<bitfield id="USB_A" description="USB_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES13" width="32" page="1" offset="0x9c" internal="0" description="ADC Software Reset register">
		<bitfield id="ADC_A" description="ADC_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B" description="ADC_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADC_D" description="ADC_D software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADC_E" description="ADC_E software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES14" width="32" page="1" offset="0x9e" internal="0" description="CMPSS Software Reset register">
		<bitfield id="CMPSS1" description="CMPSS1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2" description="CMPSS2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3" description="CMPSS3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4" description="CMPSS4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES15" width="32" page="1" offset="0xa0" internal="0" description="PGA Software Reset register">
		<bitfield id="PGA1" description="PGA1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PGA2" description="PGA2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PGA3" description="PGA3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES16" width="32" page="1" offset="0xa2" internal="0" description="DAC Software Reset register">
		<bitfield id="DAC_A" description="Buffered_DAC_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES17" width="32" page="1" offset="0xa4" internal="0" description="CLB Software Reset register">
		<bitfield id="CLB1" description="CLB1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES18" width="32" page="1" offset="0xa6" internal="0" description="FSI Software Reset register">
		<bitfield id="FSITX_A" description="FSITX_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_A" description="FSIRX_A software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES19" width="32" page="1" offset="0xa8" internal="0" description="LIN Software Reset register">
		<bitfield id="LIN_A" description="LIN_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES20" width="32" page="1" offset="0xaa" internal="0" description="PMBUS Software Reset register">
		<bitfield id="PMBUS_A" description="PMBUS_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES21" width="32" page="1" offset="0xac" internal="0" description="DCC Software Reset register">
		<bitfield id="DCC0" description="DCC Module reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DCC1" description="DCC Module reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES26" width="32" page="1" offset="0xb6" internal="0" description="AES Software Reset register">
		<bitfield id="AESA" description="AES Module Reset Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES27" width="32" page="1" offset="0xb8" internal="0" description="EPG Software Reset register">
		<bitfield id="EPG1" description="EPG Module Reset Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES28" width="32" page="1" offset="0xba" internal="0" description="Flash Software Reset register">
		<bitfield id="FLASHA" description="Flash Wrapper Module Reset Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES30" width="32" page="1" offset="0xbe" internal="0" description="TINIE Software reset register">
		<bitfield id="TINIE" description="TINIE Module Reset Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="TAP_STATUS" width="32" page="1" offset="0x130" internal="0" description="Status of JTAG State machine and Debugger Connect">
		<bitfield id="TAP_STATE" description="Present TAP State" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="DCON" description="Debugger Connect Indication" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="TAP_CONTROL" width="32" page="1" offset="0x132" internal="0" description="Disable TAP control">
		<bitfield id="BSCAN_DIS" description="Disable BSCAN TAP control" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key value to enable write" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="USBTYPE" width="16" page="1" offset="0x19a" internal="0" description="Configures USB Type for the device">
		<bitfield id="TYPE" description="Configure USB type" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ECAPTYPE" width="16" page="1" offset="0x19b" internal="0" description="Configures ECAP Type for the device">
		<bitfield id="TYPE" description="Configure ECAP type" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit for the register" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF3" width="32" page="1" offset="0x1a6" internal="0" description="MCU Configuration: ETPWM">
		<bitfield id="EPWM1" description="EPWM1 Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="EPWM2 Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="EPWM3 Present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="EPWM4 Present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="EPWM5 Present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="EPWM6 Present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="EPWM7 Present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8" description="EPWM8 Present" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9" description="EPWM9  Present" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10" description="EPWM10  Present" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11" description="EPWM11  Present" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12" description="EPWM12  Present" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF8" width="32" page="1" offset="0x1b0" internal="0" description="MCU Configuration: SCI">
		<bitfield id="SCI_A" description="SCI_A  Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SCI_B" description="SCI_B  Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SCI_C" description="SCI_C  Present" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF11" width="32" page="1" offset="0x1b6" internal="0" description="MCU Configuration: CAN">
		<bitfield id="MCAN_A" description="MCAN_A  Present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B" description="MCAN_B  Present" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF12" width="32" page="1" offset="0x1b8" internal="0" description="MCU Configuration: McBSP_USB">
		<bitfield id="USB_A" description="Decides the capability of the USB_A Module" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF14" width="32" page="1" offset="0x1bc" internal="0" description="MCU Configuration: ADC">
		<bitfield id="ADC_A" description="ADC_A Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B" description="ADC_B Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C Present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADC_D" description="ADC_D Present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADC_E" description="ADC_E Present" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF16" width="32" page="1" offset="0x1c0" internal="0" description="MCU Configuration: PGA">
		<bitfield id="PGA1" description="PGA1  Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PGA2" description="PGA2 Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PGA3" description="PGA3 Present" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF18" width="32" page="1" offset="0x1c4" internal="0" description="MCU Configuration: Lx.1 SRAM Customization">
		<bitfield id="LS0_1" description="LS0_1 Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LS1_1" description="LS1_1  Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LS2_1" description="LS2_1  Present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LS3_1" description="LS3_1  Present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LS4_1" description="LS4_1  Present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LS5_1" description="LS5_1  Present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LS6_1" description="LS6_1 Present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LS7_1" description="LS7_1 Present" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LS8_1" description="LS8_1 Present" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="LS9_1" description="LS9_1 Present" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF20" width="32" page="1" offset="0x1c8" internal="0" description="MCU Configuration: GSx SRAM Customization">
		<bitfield id="GS0" description="GS0  Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GS1" description="GS1  Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GS2" description="GS2  Present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GS3" description="GS3  Present" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF21" width="32" page="1" offset="0x1ca" internal="0" description="MCU Configuration: CLB">
		<bitfield id="CLB1" description="CLB1 Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 Present" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF23" width="32" page="1" offset="0x1ce" internal="0" description="MCU Configuration: LIN">
		<bitfield id="LIN_A" description="LIN_A  Present" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF31" width="32" page="1" offset="0x1de" internal="0" description="MCU Configuration: Flash Bank0">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF32" width="32" page="1" offset="0x1e0" internal="0" description="MCU Configuration: Flash Bank1">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF33" width="32" page="1" offset="0x1e2" internal="0" description="MCU Configuration: Flash Bank2">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF34" width="32" page="1" offset="0x1e4" internal="0" description="MCU Configuration: Flash Bank3">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF35" width="32" page="1" offset="0x1e6" internal="0" description="MCU Configuration: Flash Bank4">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNFLOCK" width="32" page="1" offset="0x1f8" internal="0" description="Lock bit for MCUCNFx registers">
		<bitfield id="MCUCNFLOCK" description="Lock bit for MCUCNF registers" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
